app/controllers/amazon_import_batches_controller.rb

  def create
    result = AmazonSettlementImporter.import!(params[:file], user: Current.user)
    return redirect_to(new_amazon_import_batch_path, alert: result.errors.to_sentence) if result.errors.any?

    batch = result.batch
    needs_review_count = batch.amazon_import_rows.needs_review.count
    notice = ["Imported #{helpers.pluralize(helpers.number_with_delimiter(batch.row_count), "row")}."]
    notice << (needs_review_count.zero? ? "Every row was categorized." : "#{helpers.pluralize(helpers.number_with_delimiter(needs_review_count), "row")} still #{needs_review_count == 1 ? "needs" : "need"} a category.")
    if result.skipped_count.positive?
      notice << "Skipped #{helpers.pluralize(helpers.number_with_delimiter(result.skipped_count), "row")} from #{result.skipped_years.to_sentence} because Amazon sync already covers #{result.skipped_years.one? ? "that year" : "those years"}."
---
SELECT COUNT(*) FROM "amazon_import_rows" WHERE "amazon_import_rows"."amazon_import_batch_id" = ?  [["amazon_import_batch_id", 3]]
INSERT INTO "amazon_import_rows" ("amazon_import_batch_id", "source_row_number", "posted_on", "settlement_id", "order_id", "transaction_type", "amount_type", "amount_description", "description", "marketplace", "amount_cents", "tax_category", "status", "raw_data", "transaction_id", "expense_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "amazon_import_batches" ("filename", "status", "row_count", "imported_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def show
    @batch = Current.user.amazon_import_batches.find(params[:id])
---
SELECT "amazon_import_batches".* FROM "amazon_import_batches" WHERE "amazon_import_batches"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]