app/controllers/amazon_import_batches_controller.rb

  def index
    @batches = Current.user.amazon_import_batches.order(imported_at: :desc)
---
SELECT "amazon_import_batches".* FROM "amazon_import_batches" ORDER BY "amazon_import_batches"."imported_at" DESC

  def show
    @batch = Current.user.amazon_import_batches.find(params[:id])
    @status_counts = @batch.amazon_import_rows.group(:status).count
    @query = params[:q].to_s.strip.first(100)
    @category = params[:category] if AmazonImportRow::TAX_CATEGORIES.key?(params[:category])
    @review_status = params[:status] if AmazonImportRow.statuses.key?(params[:status])
    @min_amount = params[:min_amount].to_s.strip.first(20)
    @max_amount = params[:max_amount].to_s.strip.first(20)
    @sort = params[:sort] == "oldest" ? "oldest" : "newest"
    min_cents = amount_cents(@min_amount)
    max_cents = amount_cents(@max_amount)
    @amount_error = if (@min_amount.present? && min_cents.nil?) || (@max_amount.present? && max_cents.nil?)
      "Enter amounts of $0 or more, using at most two decimal places."
    elsif min_cents && max_cents && min_cents > max_cents
      "Minimum amount must be less than or equal to maximum amount."
    end
    @filters_active = @query.present? || @category.present? || @review_status.present? || @min_amount.present? || @max_amount.present? || @sort == "oldest"
    @view_all = params[:view] == "all" || @filters_active
    @open_group = params[:open_group].to_s.first(120)

    if @view_all
      rows = @batch.amazon_import_rows
      if @query.present?
        pattern = "%#{ActiveRecord::Base.sanitize_sql_like(@query)}%"
        rows = rows.where("description LIKE :query OR order_id LIKE :query OR transaction_type LIKE :query OR amount_description LIKE :query", query: pattern)
        rows = rows.or(@batch.amazon_import_rows.where(source_row_number: @query.to_i)) if @query.match?(/\A\d+\z/)
---
SELECT "amazon_import_rows".* FROM "amazon_import_rows" WHERE "amazon_import_rows"."amazon_import_batch_id" = ? ORDER BY "amazon_import_rows"."source_row_number" ASC  [["amazon_import_batch_id", 2]]