app/controllers/amazon_import_rows_controller.rb

  def update
    row = Current.user.amazon_import_rows.find(params[:id])
---
SELECT "amazon_import_rows".* FROM "amazon_import_rows" WHERE "amazon_import_rows"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]