app/controllers/dashboard_controller.rb

SELECT "transactions".* FROM "transactions" ORDER BY "transactions"."transacted_on" DESC LIMIT ?  [["LIMIT", 8]]
---
  def index
    @cash_balance = Account.asset.sum(:balance_cents) / 100.0
    @monthly_revenue = Transaction.current_month.revenue.sum(:amount_cents) / 100.0
    @monthly_expenses = Transaction.current_month.expense.sum(:amount_cents) / 100.0
    @outstanding_invoices = Invoice.outstanding.sum(:total_cents) / 100.0
    @recent_transactions = Transaction.includes(:debit_account, :credit_account).order(transacted_on: :desc).limit(8)