app/controllers/turbo_tax_exports_controller.rb

  def set_year
    @year = params[:year].presence&.to_i || AmazonImportRow.where.not(posted_on: nil).maximum("strftime('%Y', posted_on)")&.to_i || Date.current.year
---
SELECT MAX(strftime('%Y', posted_on)) FROM "amazon_import_rows" WHERE "amazon_import_rows"."posted_on" IS NOT NULL